# GetLightGroupManager Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightGroupManager..::..GetLightGroupManager Method
LightGroupManager Class See Also
---
Creates a light group manager object from the given document
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static LightGroupManager GetLightGroupManager(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetLightGroupManager ( _
	document As Document _
) As LightGroupManager
```

Visual C++
---
```text
public:
static LightGroupManager^ GetLightGroupManager(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document the manager is from
# ### Return Value
The newly created Light group manager object
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The document is not valid because it is not a project (rvt) document |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace